УТ_для_edt/src/Catalogs/смартЭтапыПроцессов/смартЭтапыПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартЭтапыПроцессов</name>
  <comment>//++ #Б-4738 смарт: Фролов 17.11.2025 //Создание отчета по эффективности обработки заявок СЦ. </comment>
  <predefined>
    <items>
      <name>ВсеЭтапы</name>
      <description>Все этапы</description>
    </items>
    <items>
      <name>ИнженернаяСлужба</name>
      <description>Инженерная служба</description>
    </items>
    <items>
      <name>КонтрольКачества</name>
      <description>Контроль качества</description>
    </items>
    <items>
      <name>ПредварительнаяПроверка</name>
      <description>Предварительная проверка</description>
    </items>
    <items>
      <name>ТехническаяПоддержка</name>
      <description>Техническая поддержка</description>
    </items>
  </predefined>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеСтатусыИПереходы</name>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.смартСтатусыЗаявокНаРемонтныеРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.смартЭтапыПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребоватьКомментарий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтрольПереходовПоЭтапам</name>
    <comment>//++ #Б-5892 смарт: Фролов 07.04.2026 //Создание механизма гибкой настройки ЗРР.</comment>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.смартСтатусыЗаявокНаРемонтныеРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.смартЭтапыПроцессов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/смартЭтапыПроцессов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	//++ #Б-5892 смарт: Фролов 07.04.2026 //Создание механизма гибкой настройки ЗРР.
	СписокВыбораЭлемент = Элементы.КонтрольПереходовПоЭтапамИмяРеквизита.СписокВыбора; 
	
	СписокВыбораЭлемент.Добавить("ИтогоБесплатныеУслуги", "Итого бесплатные услуги (руб.)");
	СписокВыбораЭлемент.Добавить("ПояснениеПоВалюте", "Внимание! Вне зависимости от вида цена, цены всегда пересчитываются в Рубли");
	СписокВыбораЭлемент.Добавить("ПостроениеЦветовыхПрофилей", "Построение цветовых профилей");
	СписокВыбораЭлемент.Добавить("ПереченьНеобходимыхРабот", "Перечень необходимых работ");
	СписокВыбораЭлемент.Добавить("ДокументыОтКлиента", "Документы от клиента");
	СписокВыбораЭлемент.Добавить("КтоОплачиваетВыездСИ", "Выезд сервисного инженера оплачивает");
	СписокВыбораЭлемент.Добавить("ДоговорНаСервисноеОбслуживание", "Договор на сервисное обслуживание");
	СписокВыбораЭлемент.Добавить("КомментарийМенеджера", "Комментарий менеджера");
	СписокВыбораЭлемент.Добавить("ДанныеИзПисьмаОснования", "Данные из письма основания");
	СписокВыбораЭлемент.Добавить("ОписаниеНеисправности", "Описание неисправности");
	СписокВыбораЭлемент.Добавить("ЗаключениеИнженераОВозможностиДопГарантии", "Возможность предоставления доп. гарантии");
	СписокВыбораЭлемент.Добавить("КомментарийОВозможномПредоставленииДопГарантии", "Комментарий о возможном предоставлении доп гарантии");
	СписокВыбораЭлемент.Добавить("НеобходимыеЗапчасти", "Необходимые запчасти");
	СписокВыбораЭлемент.Добавить("ЗаключениеОВыезде", "Заключениео выезде");
	СписокВыбораЭлемент.Добавить("ОСКлиента", "ОС клиента");
	СписокВыбораЭлемент.Добавить("СостояниеЗаявки", "Состояние заявки");
	СписокВыбораЭлемент.Добавить("ПричинаЗакрытия", "Причина закрытия");
	СписокВыбораЭлемент.Добавить("ВариантПроблемы", "Вариант проблем");
	СписокВыбораЭлемент.Добавить("ГарантияПроверена", "Гарантия проверена");
	СписокВыбораЭлемент.Добавить("СерийныйНомерСверен", "Серийный номер сверен");
	СписокВыбораЭлемент.Добавить("НоменклатураПроверена", "Номенклатура проверена");
	СписокВыбораЭлемент.Добавить("ДоговорЕсть", "Договор есть");
	СписокВыбораЭлемент.Добавить("ДополнительноеСоглашение", "Дополнительное соглашение");
	СписокВыбораЭлемент.Добавить("РезультатДиагностики", "Результат диагностики");
	СписокВыбораЭлемент.Добавить("ВариантПроблемыТекст", "Вариант проблемы текст");
	СписокВыбораЭлемент.Добавить("Срочно", "Срочно");
	
	СписокВыбораЭлемент.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветФона = Новый ХранилищеЗначения(ЦветФона);
	ТекущийОбъект.ЦветТекста = Новый ХранилищеЗначения(ЦветТекста); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	ЦветФона = СправочникОбъект.ЦветФона.Получить();
	ЦветТекста = СправочникОбъект.ЦветТекста.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольПереходовПоЭтапамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ТекущиеДанныеПереходы = Элементы.ДоступныеСтатусыИПереходы.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ ТекущиеДанныеПереходы = Неопределено Тогда
		
		ТекущиеДанные.Статус = ТекущиеДанныеПереходы.Статус;	
		ТекущиеДанные.Этап = ТекущиеДанныеПереходы.Этап;	
		
	Иначе
		
		Возврат;
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти
